# BackgroundSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BackgroundSettings Class
Members See Also
---
Represents the rendering background settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class BackgroundSettings : IDisposable
```

Visual Basic
---
```text
Public Class BackgroundSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BackgroundSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BackgroundSettings Autodesk.Revit.DB..::..ColorBackgroundSettings Autodesk.Revit.DB..::..GradientBackgroundSettings Autodesk.Revit.DB..::..ImageBackgroundSettings Autodesk.Revit.DB..::..SkyBackgroundSettings
# See Also
BackgroundSettings Members
Autodesk.Revit.DB Namespace